authz_benchmark/jmeter_report/k8s_1ng_1j_3r_1000t_1200e_4cpu_async2_https_http2/h2load.out
starting benchmark...
spawning thread #0: 1200 total client(s). Timing-based test with 0s of warm-up time and 900s of main duration for measurements.
Warm-up started for thread #0.
progress: 10% of clients started
progress: 20% of clients started
progress: 30% of clients started
progress: 40% of clients started
progress: 50% of clients started
progress: 60% of clients started
progress: 70% of clients started
progress: 80% of clients started
progress: 90% of clients started
progress: 100% of clients started
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
TLS Protocol: TLSv1.3
Cipher: TLS_AES_256_GCM_SHA384
Server Temp Key: X25519 253 bits
Application protocol: h2
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0

finished in 900.34s, 2833.30 req/s, 21.30MB/s
requests: 2549970 total, 2551170 started, 2549970 done, 2549970 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 2549971 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 18.72GB (20098930213) total, 248.05MB (260097042) headers (space savings 32.00%), 18.39GB (19746975424) data
                     min         max         mean         sd        +/- sd
time for request:    52.64ms       1.50s    424.36ms     42.17ms    73.27%
time for connect:    59.49ms    597.55ms    356.86ms    144.87ms    59.00%
time to 1st byte:   457.18ms       1.25s    742.53ms    144.95ms    75.17%
req/s           :       2.36        2.36        2.36        0.00    63.50%